artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            firstName: "Test"
            lastName: "Test-User"
            email: "test@example.com"
            password: "Password123"

  - flow:
      - post:
          url: "/albums"
          json:
            title: "Channel Orange"
            artist: "Frank Ocean"
            description: "Legendary R&B album" 
            dateReleased: "2015"
            genre: "R&B"
            label: "Capital Records"